CSI API ETABS v1
cPropMaterial.GetDamping Method
 Retrieves the additional material damping data for the material.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDamping(
	string Name,
	ref double ModalRatio,
	ref double ViscousMassCoeff,
	ref double ViscousStiffCoeff,
	ref double HystereticMassCoeff,
	ref double HystereticStiffCoeff,
	double Temp = 0
)
Function GetDamping (
	Name As String,
	ByRef ModalRatio As Double,
	ByRef ViscousMassCoeff As Double,
	ByRef ViscousStiffCoeff As Double,
	ByRef HystereticMassCoeff As Double,
	ByRef HystereticStiffCoeff As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim ModalRatio As Double
Dim ViscousMassCoeff As Double
Dim ViscousStiffCoeff As Double
Dim HystereticMassCoeff As Double
Dim HystereticStiffCoeff As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetDamping(Name,
	ModalRatio, ViscousMassCoeff, ViscousStiffCoeff,
	HystereticMassCoeff, HystereticStiffCoeff,
	Temp)
int GetDamping(
	String^ Name,
	double% ModalRatio,
	double% ViscousMassCoeff,
	double% ViscousStiffCoeff,
	double% HystereticMassCoeff,
	double% HystereticStiffCoeff,
	double Temp = 0
)
abstract GetDamping :
        Name : string *
        ModalRatio : float byref *
        ViscousMassCoeff : float byref *
        ViscousStiffCoeff : float byref *
        HystereticMassCoeff : float byref *
        HystereticStiffCoeff : float byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
ModalRatio
Type: System.Double
The modal damping ratio.
ViscousMassCoeff
Type: System.Double
The mass coefficient for viscous proportional damping.
ViscousStiffCoeff
Type: System.Double
The stiffness coefficient for viscous proportional damping.
HystereticMassCoeff
Type: System.Double
The mass coefficient for hysteretic proportional damping.
HystereticStiffCoeff
Type: System.Double
The stiffness coefficient for hysteretic proportional damping.
Temp (Optional)
Type: System.Double
The temperature at which the specified data is to be retrieved. The temperature must have been previously defined for the material
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim ModalRatio As Double
       Dim ViscousMassCoeff As Double
       Dim ViscousStiffCoeff As Double
       Dim HystereticMassCoeff As Double
       Dim HystereticStiffCoeff As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign material damping data
     ret = SapModel.PropMaterial.SetDamping("4000Psi", 0.04, 0, 0, 0, 0)
   'get material damping data
     ret = SapModel.PropMaterial.GetDamping("4000Psi", ModalRatio, ViscousMassCoeff, ViscousStiffCoeff, HystereticMassCoeff, HystereticStiffCoeff)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace